<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# Initial data analysis with numeric functions

In this notebook, we demonstrate how to extract basic metadata about a dataset using numeric functions.

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `united_nations` database.

## Learning objectives

By the end of this train, you should:
- Understand how to perform an initial data analysis using SQL numeric functions.

## Connecting to our MySQL database

Using our `Access_to_Basic_Services` table created in MySQL Workbench, we want to answer some questions on the range of our dataset. We can apply the same queries in MySQL Workbench and in this notebook if we connect to our MySQL server. Since we have a MySQL database, we can connect to it using mysql and pymysql.

In [4]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:12122001UPi@localhost:3306/united_nations

Connecting and switching to connection 'mysql+pymysql://root:***@localhost:3306/united_nations'

To make a query, we add the `%%sql` command to the start of a cell, create one open line, and then the query like below, and run the cell.

In [29]:
%%sql

SELECT 
    *
FROM
    Access_to_Basic_Services
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+----------+
| COUNT(*) |
+----------+
|   1048   |
+----------+

## Exercise
We want to determine the following:
1. What is the total number of entries in the dataset?
2. What are the earliest and latest years for which we have data?
3. How many countries are included in this dataset?
4. What is the average percentage of people who have access to managed drinking water services across all years and all countries included in our dataset?

### 1. What is the total number of entries in the dataset?

Count the number of entries in the dataset using the COUNT function. Return the result with an alias.

In [30]:
%%sql
    SELECT 
        COUNT(*)
    FROM 
        Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+----------+
| COUNT(*) |
+----------+
|   1048   |
+----------+

### 2. What are the earliest and latest years for which we have data?

Determine the earliest and latest years by calculating the minimum and maximum of the `Time_period` column using the MIN and MAX functions respectively. Use aliases to name the results.

In [41]:
%%sql 
    SELECT 
        MIN(Time_period) As Earliest_yr,
        MAX(Time_Period) As Latest_yr
    FROM 
        Access_To_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+-------------+-----------+
| Earliest_yr | Latest_yr |
+-------------+-----------+
|     2015    |    2020   |
+-------------+-----------+

### 3. How many countries are included in this dataset?

Count the number of countries in the `Country_name` column. Note, if we only use the COUNT function without an additional keyword, SQL will return the total number of entries in the column, including duplicates. Use the DISTINCT keyword to only return unique country names. Return the result with an alias.

In [37]:
%%sql
SELECT  
    COUNT(DISTINCT Country_name)
FROM 
    Access_To_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+------------------------------+
| COUNT(DISTINCT Country_name) |
+------------------------------+
|             182              |
+------------------------------+

### 4. What is the average percentage of people who have access to managed drinking water services across all years and all countries included in our dataset?

Use the AVG function to calculate the average of the `Pct_managed_drinking_water_services` column. Use an alias.

In [38]:
%%sql
SELECT 
    AVG(Pct_managed_drinking_water_services) AS AVG_Pct
FROM
    Access_To_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+-----------+
|  AVG_Pct  |
+-----------+
| 87.189103 |
+-----------+

## Solutions

### 1. What is the total number of entries in the dataset?

In [39]:
%%sql

SELECT
    COUNT(*) AS Number_of_observations
FROM united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+------------------------+
| Number_of_observations |
+------------------------+
|          1048          |
+------------------------+

Here, we could’ve also used any of the columns to get the count of entries.

### 2. What are the earliest and latest years for which we have data?

In [42]:
%%sql

SELECT
    MIN(Time_period) AS Min_time_period,
    MAX(Time_period) AS Max_time_period
FROM united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+-----------------+-----------------+
| Min_time_period | Max_time_period |
+-----------------+-----------------+
|       2015      |       2020      |
+-----------------+-----------------+

### 3. How many countries are included in this dataset?

In [43]:
%%sql

SELECT
    COUNT(DISTINCT Country_name) AS Number_of_countries
FROM united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+---------------------+
| Number_of_countries |
+---------------------+
|         182         |
+---------------------+

### 4. What is the average percentage of people who have access to managed drinking water services across all years and all countries included in our dataset?

In [44]:
%%sql

SELECT
    AVG(Pct_managed_drinking_water_services) AS AVG_managed_drinking_water_services
FROM united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+-------------------------------------+
| AVG_managed_drinking_water_services |
+-------------------------------------+
|              87.189103              |
+-------------------------------------+

### Summary

We can also combine all of our queries into a single query to have a single return that includes all of the values.

In [45]:
%%sql

SELECT
    COUNT(*) AS Number_of_observations,
    MIN(Time_period) AS Min_time_period,
    MAX(Time_period) AS Max_time_period,
    COUNT(DISTINCT Country_name) AS Number_of_countries,
    AVG(Pct_managed_drinking_water_services) AS AVG_managed_drinking_water_services
FROM united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1 rows affected.

+------------------------+-----------------+-----------------+---------------------+-------------------------------------+
| Number_of_observations | Min_time_period | Max_time_period | Number_of_countries | AVG_managed_drinking_water_services |
+------------------------+-----------------+-----------------+---------------------+-------------------------------------+
|          1048          |       2015      |       2020      |         182         |              87.189103              |
+------------------------+-----------------+-----------------+---------------------+-------------------------------------+

Note that our results table is neatly labelled with the appropriate column names since we used aliases, i.e. the AS function. This function works especially well when we are expecting a result with multiple columns.

#  
<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>